In [1]:
import datetime
import time

import pandas as pd
import seaborn as sns
import cartopy.crs as ccrs
import cartopy.feature as cfeature
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker
import pgpasslib

from querymsc import WorkflowTools
%load_ext autoreload
%autoreload 2

In [2]:
connection_string = "postgresql+psycopg2://nannau@dbmsc.pcic.uvic.ca/msc"
engine = create_engine(connection_string)
Session = sessionmaker(bind=engine)
session = Session()

In [3]:
start_time = datetime.datetime(1990, 1, 1)
end_time = datetime.datetime(1991, 1, 1)

msc = WorkflowTools(start_time, end_time)

1.0 31.0 744.0

In [10]:
annual_tot_precip = msc.query_annual_precip(session)
annual_tot_rain = msc.query_annual_rain(session)
query_temp = msc.query_design_temp_percentile(session)

In [11]:
query = msc.query_design_temp_percentile(session)

In [15]:
annual_tot_precip = msc.query_annual_precip(session)
pd.read_sql(annual_tot_precip.statement, engine).head()

,annual_precip,time_min,time_max,lat,lon,station_id,obs_count,completeness
0,1052.0,1990-01-01,1990-12-31,41.7833,-82.6833,6063,365,1.0
1,1159.7,1990-01-01,1990-12-31,41.9500,-82.5167,6140,365,1.0
2,1061.4,1990-01-01,1990-12-31,42.0333,-82.9000,6036,365,1.0
3,1144.4,1990-01-01,1990-12-31,42.0431,-82.6739,6040,365,1.0
4,1189.5,1990-01-01,1990-12-31,42.1034,-83.0945,5992,365,1.0

In [16]:
annual_tot_rain = msc.query_annual_rain(session)
pd.read_sql(annual_tot_rain.statement, engine).head()

,annual_rain,time_min,time_max,lat,lon,station_id,obs_count,completeness
0,1013.6,1990-01-01,1990-12-31,41.7833,-82.6833,6063,365,1.0
1,1102.7,1990-01-01,1990-12-31,41.9500,-82.5167,6140,365,1.0
2,990.4,1990-01-01,1990-12-31,42.0333,-82.9000,6036,365,1.0
3,1094.2,1990-01-01,1990-12-31,42.0431,-82.6739,6040,365,1.0
4,1097.7,1990-01-01,1990-12-31,42.1034,-83.0945,5992,365,1.0

In [17]:
query_temp = msc.query_design_temp_percentile(session)
pd.read_sql(query_temp.statement, engine).head()

,air_temperature,time_min,time_max,lat,lon,station_id,completeness
0,-6.000,1990-01-01,1990-01-31,41.7833,-82.6833,6063,0.903226
1,-9.210,1990-01-01,1990-01-31,41.9500,-82.5167,6140,0.967742
2,-9.500,1990-01-01,1990-01-31,42.0333,-82.9000,6036,1.000000
3,-11.550,1990-01-01,1990-01-31,42.0431,-82.6739,6040,0.967742
4,-7.325,1990-01-01,1990-01-31,42.1034,-83.0945,5992,0.903226

In [20]:
query_design_temp_dry = msc.query_design_temp_dry(session, month=7)
pd.read_sql(query_design_temp_dry.statement, engine).head()

,wet_bulb_temperature,time_min,time_max,lat,lon,station_id,completeness,obs_count
0,19.875,1990-07-01,1990-07-31,41.7833,-82.6833,6063,1.000000,31
1,19.375,1990-07-01,1990-07-31,41.9500,-82.5167,6140,1.000000,31
2,18.750,1990-07-01,1990-07-31,42.0333,-82.9000,6036,1.000000,31
3,19.000,1990-07-01,1990-07-31,42.0431,-82.6739,6040,0.967742,30
4,20.250,1990-07-01,1990-07-31,42.1034,-83.0945,5992,1.000000,31

In [23]:
query_design_temp_wet = msc.query_design_temp_wet(session, month=7)
pd.read_sql(query_design_temp_wet.statement, engine).head()

,wet_bulb_temp,time_min,time_max,lat,lon,station_id,completeness,obs_count
0,12.3300,1990-07-01 00:00:00,1990-07-31 23:00:00,42.2756,-82.9556,6130,1.000000,744
1,12.6050,1990-07-01 10:00:00,1990-07-31 20:00:00,42.9922,-82.3047,5970,0.434140,323
2,11.2000,1990-07-01 00:00:00,1990-07-31 23:00:00,43.0331,-81.1511,6216,1.000000,744
3,11.7375,1990-07-01 00:00:00,1990-07-31 23:00:00,43.1717,-79.9342,6373,0.666667,496
4,12.6000,1990-07-01 11:00:00,1990-07-31 21:00:00,43.2000,-79.1667,6088,0.418011,311

In [24]:
df_vars = pd.read_sql(msc.query_variables(session).statement, engine)
#df_vars[df_vars['net_var_name']=='127']
#df_vars[(df_vars['net_var_name'].astype(int) > 124) & (df_vars['net_var_name'].astype(int) < 132)]
#df_vars[df_vars['standard_name'].str.contains('temperature')]